In [1]:
import pandas as pd

In [2]:
file = "crime.csv"

In [3]:
df = pd.read_csv(file)
df.head()

,TYPE,YEAR,MONTH,DAY,HOUR,MINUTE,HUNDRED_BLOCK,NEIGHBOURHOOD,X,Y,Latitude,Longitude
0,Other Theft,2003,5,12,16.0,15.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763
1,Other Theft,2003,5,7,15.0,20.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763
2,Other Theft,2003,4,23,16.0,40.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763
3,Other Theft,2003,4,20,11.0,15.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763
4,Other Theft,2003,4,12,17.0,45.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763

In [4]:
columns=['TYPE','YEAR','MONTH', 'Latitude', 'Longitude']

In [5]:
reduced_df=df.loc[:,columns]
reduced_df.head()

          TYPE  YEAR  MONTH   Latitude   Longitude
0  Other Theft  2003      5  49.269802 -123.083763
1  Other Theft  2003      5  49.269802 -123.083763
2  Other Theft  2003      4  49.269802 -123.083763
3  Other Theft  2003      4  49.269802 -123.083763
4  Other Theft  2003      4  49.269802 -123.083763

In [6]:
len(reduced_df)

530652

In [7]:
final_df=reduced_df.loc[(reduced_df['YEAR']>=2010) & (reduced_df['YEAR']<=2017) & (reduced_df['Latitude']>0 & (reduced_df['Longitude']>0))]
len(final_df)

212908

In [8]:
final_df.to_csv("crime_data_clean.csv", encoding="utf-8", index=False, header=True)